Res-Latency-social1-v2/Res-container-set-v1/container_t_10_c_30_composePosts_composeCore_4_wrkCore_1_R_1600/wrk.txt
Running 1m test @ http://localhost:8080/wrk2-api/post/compose
  10 threads and 30 connections
  Thread calibration: mean lat.: 5.097ms, rate sampling interval: 11ms
  Thread calibration: mean lat.: 5.468ms, rate sampling interval: 11ms
  Thread calibration: mean lat.: 5.238ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 4.565ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 4.721ms, rate sampling interval: 11ms
  Thread calibration: mean lat.: 5.227ms, rate sampling interval: 11ms
  Thread calibration: mean lat.: 4.971ms, rate sampling interval: 11ms
  Thread calibration: mean lat.: 4.463ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 5.499ms, rate sampling interval: 11ms
  Thread calibration: mean lat.: 5.370ms, rate sampling interval: 11ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    25.45ms   78.94ms 409.86ms   92.55%
    Req/Sec   168.20    147.74   636.00     63.69%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    3.14ms
 75.000%    4.33ms
 90.000%   15.61ms
 99.000%  409.86ms
 99.900%  484.35ms
 99.990%  509.95ms
 99.999%  516.61ms
100.000%  519.68ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.280     0.000000            1         1.00
       2.247     0.100000         8060         1.11
       2.479     0.200000        16042         1.25
       2.687     0.300000        24067         1.43
       2.899     0.400000        32104         1.67
       3.141     0.500000        40130         2.00
       3.289     0.550000        44095         2.22
       3.457     0.600000        48119         2.50
       3.667     0.650000        52141         2.86
       3.939     0.700000        56137         3.33
       4.327     0.750000        60140         4.00
       4.599     0.775000        62149         4.44
       4.955     0.800000        64148         5.00
       5.431     0.825000        66142         5.71
       6.183     0.850000        68149         6.67
       7.723     0.875000        70150         8.00
       9.879     0.887500        71151         8.89
      15.615     0.900000        72153        10.00
      41.343     0.912500        73156        11.43
     102.591     0.925000        74158        13.33
     158.335     0.937500        75162        16.00
     189.823     0.943750        75663        17.78
     220.159     0.950000        76162        20.00
     251.519     0.956250        76664        22.86
     279.295     0.962500        77166        26.67
     311.295     0.968750        77665        32.00
     325.631     0.971875        77916        35.56
     343.295     0.975000        78169        40.00
     357.631     0.978125        78419        45.71
     373.247     0.981250        78667        53.33
     385.279     0.984375        78922        64.00
     392.191     0.985938        79044        71.11
     399.615     0.987500        79169        80.00
     405.503     0.989062        79295        91.43
     413.183     0.990625        79419       106.67
     421.887     0.992188        79547       128.00
     426.751     0.992969        79607       142.22
     430.335     0.993750        79670       160.00
     436.223     0.994531        79733       182.86
     441.343     0.995313        79797       213.33
     446.719     0.996094        79858       256.00
     450.303     0.996484        79889       284.44
     454.655     0.996875        79921       320.00
     458.495     0.997266        79954       365.71
     461.567     0.997656        79984       426.67
     465.151     0.998047        80015       512.00
     467.455     0.998242        80030       568.89
     470.783     0.998437        80049       640.00
     474.623     0.998633        80061       731.43
     479.999     0.998828        80077       853.33
     485.119     0.999023        80092      1024.00
     487.167     0.999121        80100      1137.78
     488.703     0.999219        80108      1280.00
     493.311     0.999316        80117      1462.86
     495.871     0.999414        80125      1706.67
     499.455     0.999512        80131      2048.00
     499.967     0.999561        80135      2275.56
     501.759     0.999609        80139      2560.00
     503.807     0.999658        80143      2925.71
     504.575     0.999707        80147      3413.33
     505.343     0.999756        80152      4096.00
     505.599     0.999780        80153      4551.11
     506.367     0.999805        80155      5120.00
     507.391     0.999829        80157      5851.43
     508.671     0.999854        80159      6826.67
     509.439     0.999878        80161      8192.00
     509.951     0.999890        80162      9102.22
     511.487     0.999902        80163     10240.00
     511.999     0.999915        80164     11702.86
     514.815     0.999927        80165     13653.33
     515.583     0.999939        80166     16384.00
     515.583     0.999945        80166     18204.44
     516.095     0.999951        80167     20480.00
     516.095     0.999957        80167     23405.71
     516.351     0.999963        80168     27306.67
     516.351     0.999969        80168     32768.00
     516.351     0.999973        80168     36408.89
     516.607     0.999976        80169     40960.00
     516.607     0.999979        80169     46811.43
     516.607     0.999982        80169     54613.33
     516.607     0.999985        80169     65536.00
     516.607     0.999986        80169     72817.78
     519.679     0.999988        80170     81920.00
     519.679     1.000000        80170          inf
#[Mean    =       25.451, StdDeviation   =       78.942]
#[Max     =      519.424, Total count    =        80170]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  96073 requests in 1.00m, 19.70MB read
Requests/sec:   1600.93
Transfer/sec:    336.13KB